app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "浦和"], ["body", "レッズ"], ["created_at", "2021-07-10 06:00:33.538964"], ["updated_at", "2021-07-10 06:00:33.538964"]]
---
  def create
    list = List.new(list_params)
    list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "h"], ["updated_at", "2021-07-10 08:26:40.111577"], ["id", 3]]
---
  def update
    list = List.find(params[:id])
    list.update(list_params)

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 2]]
---
  def destroy
    list = List.find(params[:id])
    list.destroy